<eos>
<!DOCTYPE
html>
<html
lang="en">
<head>
<meta
charset="utf-8">
<link
rel="dns-prefetch"
href="https://github.githubassets.com">
href="https://avatars0.githubusercontent.com">
href="https://avatars1.githubusercontent.com">
href="https://avatars2.githubusercontent.com">
href="https://avatars3.githubusercontent.com">
href="https://github-cloud.s3.amazonaws.com">
href="https://user-images.githubusercontent.com/">
crossorigin="anonymous"
media="all"
integrity="sha512-2ia9uKVaH3kVT+nmGsDyhByzQ58gG1w+0oGajxJZSpFVWsLUKanxi9lulo2dyD1NpSBjh58GI0Ov9QlihzOa4w=="
rel="stylesheet"
href="https://github.githubassets.com/assets/frameworks-c120fff53cd768eba1e1611c1137e306.css"
/>
integrity="sha512-xod5+iick6st6a0tvmfiqwCFLFTRzOkGLX0SAqY7SQFl0Q3sWxKUB2rm1Kw4Vz/57FMg7chtfVYeUB/Yr/xmFQ=="
href="https://github.githubassets.com/assets/site-d3c48f1b58ea95d9efb184fd4592b411.css"
integrity="sha512-d77lWTgrcktBCQ4BdZAlCoTXzjD6HpK2AoqOFlo1A8lvYjEQ7nEk5EWe30UVSvvrfPQoLUzAf7RFxQPbNvPRcg=="
href="https://github.githubassets.com/assets/github-a000031b67c86179918d7223230a4f5a.css"
name="viewport"
content="width=device-width">
<title>neural-complexity/train.txt
at
master
·
vansky/neural-complexity
GitHub</title>
name="description"
content="A
neural
language
model
that
estimates
incremental
processing
complexity
-
vansky/neural-complexity">
rel="search"
type="application/opensearchdescription+xml"
href="/opensearch.xml"
title="GitHub">
rel="fluid-icon"
href="https://github.com/fluidicon.png"
property="fb:app_id"
content="1401488693436528">
name="twitter:image:src"
content="https://avatars1.githubusercontent.com/u/6255296?s=400&amp;v=4"
/><meta
name="twitter:site"
content="@github"
name="twitter:card"
content="summary"
name="twitter:title"
content="vansky/neural-complexity"
name="twitter:description"
vansky/neural-complexity"
property="og:image"
property="og:site_name"
content="GitHub"
property="og:type"
content="object"
property="og:title"
property="og:url"
content="https://github.com/vansky/neural-complexity"
property="og:description"
rel="assets"
href="https://github.githubassets.com/">
name="request-id"
content="BC10:591F:3910329:5FC7AAB:5DE93AF5"
data-pjax-transient>
name="selected-link"
value="repo_source"
name="google-site-verification"
content="KT5gs8h0wvaagLKAVWq8bbeNwnZZK1r1XQysX3xurLU">
content="ZzhVyEFwb7w3e0-uOTltm8Jsck2F5StVihD0exw2fsA">
content="GXs5KoUUkNCoaAZn7wPN-t01Pywp9M3sEjnt_3_ZWPc">
name="octolytics-host"
content="collector.githubapp.com"
name="octolytics-app-id"
content="github"
name="octolytics-event-url"
content="https://collector.githubapp.com/github-external/browser_event"
name="octolytics-dimension-request_id"
name="octolytics-dimension-region_edge"
content="iad"
name="octolytics-dimension-region_render"
name="octolytics-dimension-ga_id"
content=""
class="js-octo-ga-id"
name="octolytics-dimension-visitor_id"
content="4767884849458002678"
name="analytics-location"
content="/&lt;user-name&gt;/&lt;repo-name&gt;/blob/show"
data-pjax-transient="true"
name="google-analytics"
content="UA-3769691-2">
class="js-ga-set"
name="dimension1"
content="Logged
Out">
name="hostname"
content="github.com">
name="user-login"
content="">
name="expected-hostname"
name="js-proxy-site-detection-payload"
content="ZGVlOTBlMGU5MmUwYTg5ZGY4YmM2MDZmYmFiZDcxMmI1ZTI2MzkxZWRmMzUzYzkxYTQ1MjAwMmY2MTZkYTdiMnx7InJlbW90ZV9hZGRyZXNzIjoiMy4xMzMuMTI1LjIwMiIsInJlcXVlc3RfaWQiOiJCQzEwOjU5MUY6MzkxMDMyOTo1RkM3QUFCOjVERTkzQUY1IiwidGltZXN0YW1wIjoxNTc1NTY2MDcwLCJob3N0IjoiZ2l0aHViLmNvbSJ9">
name="enabled-features"
content="MARKETPLACE_FEATURED_BLOG_POSTS,MARKETPLACE_INVOICED_BILLING,MARKETPLACE_SOCIAL_PROOF_CUSTOMERS,MARKETPLACE_TRENDING_SOCIAL_PROOF,MARKETPLACE_RECOMMENDATIONS,MARKETPLACE_PENDING_INSTALLATIONS">
name="html-safe-nonce"
content="936aefc25eec2bd66fa8c55d4d9d32604257bcc8">
http-equiv="x-pjax-version"
content="5f70e5350325c810a2a908c0c93461d6">
href="https://github.com/vansky/neural-complexity/commits/master.atom"
rel="alternate"
title="Recent
Commits
to
neural-complexity:master"
type="application/atom+xml">
name="go-import"
content="github.com/vansky/neural-complexity
git
https://github.com/vansky/neural-complexity.git">
name="octolytics-dimension-user_id"
content="6255296"
name="octolytics-dimension-user_login"
content="vansky"
name="octolytics-dimension-repository_id"
content="127470507"
name="octolytics-dimension-repository_nwo"
name="octolytics-dimension-repository_public"
content="true"
name="octolytics-dimension-repository_is_fork"
content="false"
name="octolytics-dimension-repository_network_root_id"
name="octolytics-dimension-repository_network_root_nwo"
name="octolytics-dimension-repository_explore_github_marketplace_ci_cta_shown"
rel="canonical"
href="https://github.com/vansky/neural-complexity/blob/master/data/wikitext-2/train.txt"
name="browser-stats-url"
content="https://api.github.com/_private/browser/stats">
name="browser-errors-url"
content="https://api.github.com/_private/browser/errors">
rel="mask-icon"
href="https://github.githubassets.com/pinned-octocat.svg"
color="#000000">
rel="icon"
type="image/x-icon"
class="js-site-favicon"
href="https://github.githubassets.com/favicon.ico">
name="theme-color"
content="#1e2327">
rel="manifest"
href="/manifest.json"
crossOrigin="use-credentials">
</head>
<body
class="logged-out
env-production
page-responsive
page-blob">
<div
class="position-relative
js-header-wrapper
">
<a
href="#start-of-content"
tabindex="1"
class="px-2
py-4
bg-blue
text-white
show-on-focus
js-skip-to-content">Skip
content</a>
<span
class="Progress
progress-pjax-loader
position-fixed
width-full
js-pjax-loader-bar">
class="progress-pjax-loader-bar
top-0
left-0"
style="width:
0%;"></span>
</span>
<header
class="Header-old
header-logged-out
js-details-container
Details
position-relative
f4
py-2"
role="banner">
class="container-lg
d-lg-flex
flex-items-center
p-responsive">
class="d-flex
flex-justify-between
flex-items-center">
class="mr-4"
href="https://github.com/"
aria-label="Homepage"
data-ga-click="(Logged
out)
Header,
go
homepage,
icon:logo-wordmark">
<svg
height="32"
class="octicon
octicon-mark-github
text-white"
viewBox="0
0
16
16"
version="1.1"
width="32"
aria-hidden="true"><path
fill-rule="evenodd"
d="M8
0C3.58
3.58
8c0
3.54
2.29
6.53
5.47
7.59.4.07.55-.17.55-.38
0-.19-.01-.82-.01-1.49-2.01.37-2.53-.49-2.69-.94-.09-.23-.48-.94-.82-1.13-.28-.15-.68-.52-.01-.53.63-.01
1.08.58
1.23.82.72
1.21
1.87.87
2.33.66.07-.52.28-.87.51-1.07-1.78-.2-3.64-.89-3.64-3.95
0-.87.31-1.59.82-2.15-.08-.2-.36-1.02.08-2.12
.67-.21
2.2.82.64-.18
1.32-.27
2-.27.68
1.36.09
2
.27
1.53-1.04
2.2-.82
2.2-.82.44
1.1.16
1.92.08
2.12.51.56.82
1.27.82
2.15
3.07-1.87
3.75-3.65
3.95.29.25.54.73.54
1.48
1.07-.01
1.93-.01
2.2
.21.15.46.55.38A8.013
8.013
0016
8c0-4.42-3.58-8-8-8z"/></svg>
</a>
class="d-lg-none
css-truncate
css-truncate-target
width-fit
p-2">
octicon-repo"
12
width="12"
height="16"
d="M4
9H3V8h1v1zm0-3H3v1h1V6zm0-2H3v1h1V4zm0-2H3v1h1V2zm8-1v12c0
.55-.45
1-1
1H6v2l-1.5-1.5L3
16v-2H1c-.55
0-1-.45-1-1V1c0-.55.45-1
1-1h10c.55
1
.45
1zm-1
10H1v2h2v-1h3v1h5v-2zm0-10H2v9h9V1z"/></svg>
class="Header-link"
href="/vansky">vansky</a>
/
href="/vansky/neural-complexity">neural-complexity</a>
</div>
href="/join?source=header-repo"
class="d-inline-block
d-lg-none
f5
no-underline
border
border-gray-dark
rounded-2
px-2
py-1
mr-3
mr-sm-5"
data-hydro-click="{&quot;event_type&quot;:&quot;authentication.click&quot;,&quot;payload&quot;:{&quot;location_in_page&quot;:&quot;site
header&quot;,&quot;repository_id&quot;:null,&quot;auth_type&quot;:&quot;SIGN_UP&quot;,&quot;client_id&quot;:null,&quot;originating_request_id&quot;:&quot;BC10:591F:3910329:5FC7AAB:5DE93AF5&quot;,&quot;originating_url&quot;:&quot;https://github.com/vansky/neural-complexity/blob/master/data/wikitext-2/train.txt&quot;,&quot;referrer&quot;:null,&quot;user_id&quot;:null}}"
data-hydro-click-hmac="465e06496b88f026748b63e295bbabed14bb9552040864fe1ae197f27484ecb9"
clicked
Sign
up,
text:sign-up">
Sign&nbsp;up
<button
class="btn-link
mt-1
js-details-target"
type="button"
aria-label="Toggle
navigation"
aria-expanded="false">
height="24"
octicon-three-bars
width="18"
d="M11.41
9H.59C0
9
8.59
8c0-.59
0-1
.59-1H11.4c.59
.59.41.59
.59
1-.59
1h.01zm0-4H.59C0
5
4.59
4c0-.59
1h.01zM.59
11H11.4c.59
1H.59C0
13
12.59
12c0-.59
.59-1z"/></svg>
</button>
class="HeaderMenu
HeaderMenu--logged-out
right-0
bottom-0
height-fit
position-lg-relative
flex-auto">
flex-justify-end
border-bottom
bg-gray-light
p-3">
octicon-x
text-gray"
d="M7.48
8l3.75
3.75-1.48
1.48L6
9.48l-3.75
3.75-1.48-1.48L4.52
8
.77
4.25l1.48-1.48L6
6.52l3.75-3.75
1.48L7.48
8z"/></svg>
<nav
class="mt-0
px-3
px-lg-0
mb-5
mb-lg-0"
aria-label="Global">
<ul
class="d-lg-flex
list-style-none">
<li
class="d-block
flex-lg-nowrap
flex-lg-items-center
border-lg-bottom-0
mr-0
mr-lg-3
edge-item-fix
flex-wrap
d-flex
<details
class="HeaderMenu-details
details-overlay
details-reset
width-full">
<summary
class="HeaderMenu-summary
HeaderMenu-link
px-0
py-3
border-0
no-wrap
d-block
d-lg-inline-block">
Why
GitHub?
x="0px"
y="0px"
14
8"
xml:space="preserve"
fill="none"
class="icon-chevon-down-mktg
position-absolute
position-lg-relative">
<path
d="M1,1l6.2,6L13,1"></path>
</svg>
</summary>
class="dropdown-menu
flex-auto
rounded-1
bg-white
mt-0
pb-4
p-lg-4
position-lg-absolute
left-0
left-lg-n4">
href="/features"
class="py-2
lh-condensed-ultra
link-gray-dark
h5
Bump-link--hover"
Features">Features
class="Bump-link-symbol
float-right
text-normal
text-gray-light">&rarr;</span></a>
class="list-style-none
pb-3">
class="edge-item-fix"><a
href="/features/code-review/"
link-gray
f5"
Code
review">Code
review</a></li>
href="/features/project-management/"
Project
management">Project
management</a></li>
href="/features/integrations"
Integrations">Integrations</a></li>
href="/features/actions"
Actions">Actions</a></li>
href="/features/packages"
GitHub
Packages">Packages</a></li>
href="/features/security"
Security">Security</a></li>
href="/features#team-management"
Team
management">Team
href="/features#social-coding"
Social
coding">Social
coding</a></li>
href="/features#documentation"
Documentation">Documentation</a></li>
href="/features#code-hosting"
hosting">Code
hosting</a></li>
</ul>
mb-0
border-lg-top
pt-lg-3">
href="/customer-stories"
Customer
stories">Customer
stories
text-gray-light">&rarr;</span></a></li>
href="/security"
Security">Security
</details>
</li>
class="border-bottom
mr-lg-3">
href="/enterprise"
class="HeaderMenu-link
d-lg-inline-block"
Enterprise">Enterprise</a>
Explore
pt-2
pb-0
mb-3">
href="/explore"
Explore">Explore
<h4
class="text-gray-light
text-mono
mb-2
pt-lg-3">Learn
&amp;
contribute</h4>
href="/topics"
Topics">Topics</a></li>
href="/collections"
Collections">Collections</a></li>
href="/trending"
Trending">Trending</a></li>
href="https://lab.github.com/"
Learning
lab">Learning
Lab</a></li>
href="https://opensource.guide"
Open
source
guides">Open
guides</a></li>
pt-lg-3">Connect
with
others</h4>
mb-0">
href="https://github.com/events"
Events">Events</a></li>
href="https://github.community"
Community
forum">Community
forum</a></li>
href="https://education.github.com"
Education">GitHub
Education</a></li>
href="/marketplace"
Marketplace">Marketplace</a>
Pricing
href="/pricing"
class="pb-2
Pricing">Plans
href="/pricing#feature-comparison"
Compare
plans">Compare
plans</a></li>
href="https://enterprise.github.com/contact"
Contact
Sales">Contact
Sales</a></li>
href="/nonprofit"
Nonprofits">Nonprofit
Education">Education
</nav>
text-center
text-lg-left">
mb-3
mb-lg-0">
class="header-search
flex-self-stretch
flex-lg-self-auto
mb-lg-0
scoped-search
site-scoped-search
js-site-search
js-jump-to"
role="combobox"
aria-owns="jump-to-results"
aria-label="Search
or
jump
to"
aria-haspopup="listbox"
aria-expanded="false"
>
class="position-relative">
<!--
'"`
--><!--
</textarea></xmp>
--></option></form><form
class="js-site-search-form"
role="search"
aria-label="Site"
data-scope-type="Repository"
data-scope-id="127470507"
data-scoped-search-url="/vansky/neural-complexity/search"
data-unscoped-search-url="/search"
action="/vansky/neural-complexity/search"
accept-charset="UTF-8"
method="get"><input
name="utf8"
type="hidden"
value="&#x2713;"
<label
class="form-control
input-sm
header-search-wrapper
p-0
header-search-wrapper-jump-to
js-chromeless-input-container">
<input
type="text"
header-search-input
jump-to-field
js-jump-to-field
js-site-search-focus
js-site-search-field
is-clearable"
data-hotkey="s,/"
name="q"
value=""
placeholder="Search"
data-unscoped-placeholder="Search
GitHub"
data-scoped-placeholder="Search"
autocapitalize="off"
aria-autocomplete="list"
aria-controls="jump-to-results"
aria-label="Search"
data-jump-to-suggestions-path="/_graphql/GetSuggestedNavigationDestinations#csrf-token=aXVR023SCc7O30jDawXEmVHUx9KAcTbFc7OhozQDQJXS0zYT8PA/WeOVHSZElrZqHJGcTwsUsFnpSQTmPmyrEw=="
spellcheck="false"
autocomplete="off"
class="js-site-search-type-field"
name="type"
<img
src="https://github.githubassets.com/images/search-key-slash.svg"
alt=""
class="mr-2
header-search-key-slash">
class="Box
overflow-hidden
d-none
jump-to-suggestions
js-jump-to-suggestions-container">
class="d-none
js-jump-to-suggestions-template-container">
flex-justify-start
navigation-item
js-navigation-item
js-jump-to-suggestion"
role="option">
tabindex="-1"
class="no-underline
jump-to-suggestions-path
js-jump-to-suggestion-path
js-navigation-open
p-2"
href="">
class="jump-to-octicon
js-jump-to-octicon
flex-shrink-0
mr-2
d-none">
width="16"
octicon-repo
js-jump-to-octicon-repo
d-none"
title="Repository"
aria-label="Repository"
role="img"><path
octicon-project
js-jump-to-octicon-project
title="Project"
aria-label="Project"
15
d="M10
12h3V2h-3v10zm-4-2h3V2H6v8zm-4
4h3V2H2v12zm-1
1h13V1H1v14zM14
0H1a1
00-1
1v14a1
001
1h13a1
001-1V1a1
00-1-1z"/></svg>
octicon-search
js-jump-to-octicon-search
title="Search"
d="M15.7
13.3l-3.81-3.83A5.93
5.93
0013
6c0-3.31-2.69-6-6-6S1
2.69
6s2.69
6
6c1.3
2.48-.41
3.47-1.11l3.83
3.81c.19.2.45.3.7.3.25
.52-.09.7-.3a.996.996
000-1.41v.01zM7
10.7c-2.59
0-4.7-2.11-4.7-4.7
0-2.59
2.11-4.7
4.7-4.7
2.59
4.7
2.11
2.59-2.11
4.7z"/></svg>
class="avatar
js-jump-to-suggestion-avatar
aria-label="Team"
src=""
width="28"
height="28">
class="jump-to-suggestion-name
js-jump-to-suggestion-name
text-left
css-truncate-target">
class="border
bg-gray
px-1
text-gray-light
ml-1
f6
js-jump-to-badge-search">
class="js-jump-to-badge-search-text-default
aria-label="in
this
repository">
In
repository
class="js-jump-to-badge-search-text-global
all
of
GitHub">
All
aria-hidden="true"
v-align-middle">↵</span>
d-on-nav-focus
js-jump-to-badge-jump">
Jump
js-jump-to-no-results-template-container">
flex-justify-center
js-jump-to-suggestion
class="text-gray">No
suggested
results</span>
id="jump-to-results"
role="listbox"
class="p-0
m-0
js-navigation-container
jump-to-suggestions-results-container
js-jump-to-suggestions-results-container">
js-jump-to-scoped-search
js-jump-to-global-search
</label>
</form>
href="/login?return_to=%2Fvansky%2Fneural-complexity%2Fblob%2Fmaster%2Fdata%2Fwikitext-2%2Ftrain.txt"
mr-3"
header
menu&quot;,&quot;repository_id&quot;:null,&quot;auth_type&quot;:&quot;SIGN_UP&quot;,&quot;client_id&quot;:null,&quot;originating_request_id&quot;:&quot;BC10:591F:3910329:5FC7AAB:5DE93AF5&quot;,&quot;originating_url&quot;:&quot;https://github.com/vansky/neural-complexity/blob/master/data/wikitext-2/train.txt&quot;,&quot;referrer&quot;:null,&quot;user_id&quot;:null}}"
data-hydro-click-hmac="9ac31dee4b439d1b6ddbb28856ed40b701c9d0d0f0dc451011a9994d083d6a56"
in,
text:sign-in">
Sign&nbsp;in
href="/join?source=header-repo&amp;source_repo=vansky%2Fneural-complexity"
d-inline-block
py-1"
</header>
id="start-of-content"
class="show-on-focus"></div>
id="js-flash-container">
class="application-main
"
data-commit-hovercards-enabled>
itemscope
itemtype="http://schema.org/SoftwareSourceCode"
class="">
<main
class="
pagehead
repohead
instapaper_ignore
readability-menu
experiment-repo-nav
pt-0
pt-lg-4
class="repohead-details-container
clearfix
container-lg
p-responsive
d-lg-block">
class="pagehead-actions">
<li>
class="tooltipped
tooltipped-s
btn
btn-sm
btn-with-count"
aria-label="You
must
be
signed
in
watch
a
repository"
rel="nofollow"
data-hydro-click="{&quot;event_type&quot;:&quot;authentication.click&quot;,&quot;payload&quot;:{&quot;location_in_page&quot;:&quot;notification
subscription
menu
watch&quot;,&quot;repository_id&quot;:null,&quot;auth_type&quot;:&quot;LOG_IN&quot;,&quot;client_id&quot;:null,&quot;originating_request_id&quot;:&quot;BC10:591F:3910329:5FC7AAB:5DE93AF5&quot;,&quot;originating_url&quot;:&quot;https://github.com/vansky/neural-complexity/blob/master/data/wikitext-2/train.txt&quot;,&quot;referrer&quot;:null,&quot;user_id&quot;:null}}"
data-hydro-click-hmac="788177691a552d9c9b518ffa6b9fddd41f517bbc845d01da8a311e5690d47005"
href="/login?return_to=%2Fvansky%2Fneural-complexity">
octicon-eye
v-align-text-bottom"
d="M8.06
2C3
8s3
8.06
6C13
8s-3-6-7.94-6zM8
12c-2.2
0-4-1.78-4-4
0-2.2
1.8-4
4-4
2.22
4
1.8
2.22-1.78
4zm2-4c0
1.11-.89
2-2
2-1.11
0-2-.89-2-2
0-1.11.89-2
1.11
.89
2z"/></svg>
Watch
class="social-count"
href="/vansky/neural-complexity/watchers"
aria-label="1
user
is
watching
class="btn
btn-with-count
tooltipped
tooltipped-s"
star
data-hydro-click="{&quot;event_type&quot;:&quot;authentication.click&quot;,&quot;payload&quot;:{&quot;location_in_page&quot;:&quot;star
button&quot;,&quot;repository_id&quot;:127470507,&quot;auth_type&quot;:&quot;LOG_IN&quot;,&quot;client_id&quot;:null,&quot;originating_request_id&quot;:&quot;BC10:591F:3910329:5FC7AAB:5DE93AF5&quot;,&quot;originating_url&quot;:&quot;https://github.com/vansky/neural-complexity/blob/master/data/wikitext-2/train.txt&quot;,&quot;referrer&quot;:null,&quot;user_id&quot;:null}}"
data-hydro-click-hmac="0b2e889d2d0ec0c08d4f7abb4a972743e4d102426cd29ac1f070b12ac0eca97d"
octicon-star
width="14"
d="M14
6l-4.9-.64L7
4.9
5.36
6l3.6
3.26L2.67
7
11.67
11.33
14l-.93-4.74L14
6z"/></svg>
Star
class="social-count
js-social-count"
href="/vansky/neural-complexity/stargazers"
aria-label="8
users
starred
fork
data-hydro-click="{&quot;event_type&quot;:&quot;authentication.click&quot;,&quot;payload&quot;:{&quot;location_in_page&quot;:&quot;repo
details
data-hydro-click-hmac="04ffaffbf756eab14dcd9deac585caea47ca5c7e2d1732ae21208f971cf32e78"
octicon-repo-forked
10
width="10"
1a1.993
1.993
3.72V6L5
3
6V4.72A1.993
002
3.72V6.5l3
3v1.78A1.993
005
15a1.993
001-3.72V9.5l3-3V4.72A1.993
008
1zM2
4.2C1.34
4.2.8
3.65.8
3c0-.65.55-1.2
1.2-1.2.65
1.2.55
1.2
.65-.55
1.2-1.2
1.2zm3
10c-.66
0-1.2-.55-1.2-1.2
0-.65.55-1.2
1.2zm3-10c-.66
1.2z"/></svg>
Fork
href="/vansky/neural-complexity/network/members"
aria-label="2
forked
<h1
class="public
class="author"
itemprop="author"><a
class="url
fn"
rel="author"
data-hovercard-type="user"
data-hovercard-url="/users/vansky/hovercard"
data-octo-click="hovercard-link-click"
data-octo-dimensions="link_type:self"
href="/vansky">vansky</a></span><!--
--><span
class="path-divider">/</span><!--
--><strong
itemprop="name"><a
data-pjax="#js-repo-pjax-container"
href="/vansky/neural-complexity">neural-complexity</a></strong>
</h1>
class="hx_reponav
reponav
js-repo-nav
js-sidenav-container-pjax
d-lg-block"
itemtype="http://schema.org/BreadcrumbList"
data-pjax="#js-repo-pjax-container">
itemtype="http://schema.org/ListItem"
itemprop="itemListElement">
class="js-selected-navigation-item
selected
reponav-item"
itemprop="url"
data-hotkey="g
c"
aria-current="page"
data-selected-links="repo_source
repo_downloads
repo_commits
repo_releases
repo_tags
repo_branches
repo_packages
/vansky/neural-complexity"
href="/vansky/neural-complexity">
class="d-inline"><svg
octicon-code"
d="M9.5
3L8
4.5
11.5
9.5
3zm-5
0L0
8l4.5
5L6
2.5
3z"/></svg></div>
itemprop="name">Code</span>
itemprop="position"
content="1">
i"
data-selected-links="repo_issues
repo_labels
repo_milestones
/vansky/neural-complexity/issues"
href="/vansky/neural-complexity/issues">
octicon-issue-opened"
d="M7
2.3c3.14
5.7
2.56
5.7s-2.56
5.7-5.7
5.7A5.71
5.71
011.3
8c0-3.14
2.56-5.7
5.7-5.7zM7
1C3.14
4.14
8s3.14
7-3.14
7-7-3.14-7-7-7zm1
3H6v5h2V4zm0
6H6v2h2v-2z"/></svg></div>
itemprop="name">Issues</span>
class="Counter">0</span>
content="2">
p"
data-skip-pjax="true"
data-selected-links="repo_pulls
checks
/vansky/neural-complexity/pulls"
href="/vansky/neural-complexity/pulls">
octicon-git-pull-request"
d="M11
11.28V5c-.03-.78-.34-1.47-.94-2.06C9.46
2.35
8.78
2.03
2H7V0L4
3l3
3V4h1c.27.02.48.11.69.31.21.2.3.42.31.69v6.28A1.993
0010
001-3.72zm-1
2.92c-.66
1.2zM4
3c0-1.11-.89-2-2-2a1.993
3.72v6.56A1.993
001-3.72V4.72c.59-.34
1-.98
1-1.72zm-.8
10c0
.66-.55
1.2-.65
1.2zM2
1.2z"/></svg></div>
itemprop="name">Pull
requests</span>
content="3">
b"
data-selected-links="repo_projects
new_repo_project
repo_project
/vansky/neural-complexity/projects"
href="/vansky/neural-complexity/projects">
octicon-project"
width="15"
00-1-1z"/></svg></div>
Projects
class="Counter"
>0</span>
data-selected-links="security
alerts
policy
code_scanning
/vansky/neural-complexity/security/advisories"
href="/vansky/neural-complexity/security/advisories">
octicon-shield"
d="M0
2l7-2
2v6.02C14
12.69
8.69
16c-1.69
0-7-3.31-7-7.98V2zm1
.75L7
1l6
1.75v5.268C13
12.104
8.449
15c-1.449
0-6-2.896-6-6.982V2.75zm1
2v12c-1.207
0-5-2.482-5-5.985V3.5z"/></svg></div>
Security
data-selected-links="repo_graphs
repo_contributors
dependency_graph
pulse
people
/vansky/neural-complexity/pulse"
href="/vansky/neural-complexity/pulse">
octicon-graph"
d="M16
14v1H0V0h1v14h15zM5
13H3V8h2v5zm4
0H7V3h2v10zm4
0h-2V6h2v7z"/></svg></div>
Insights
class="reponav-wrapper
reponav-small
d-lg-none">
class="reponav
js-reponav
no-wrap"
itemtype="http://schema.org/BreadcrumbList">
itemprop="name">Projects</span>
content="4">
itemprop="name">Security</span>
content="6">
data-selected-links="pulse
Pulse
new-discussion-timeline
class="repository-content
js-permalink-shortcut"
data-hotkey="y"
href="/vansky/neural-complexity/blob/bf40b9e0ec43821d5149bcdf4478d9adeb834f8d/data/wikitext-2/train.txt">Permalink</a>
blob
contrib
key:
blob_contributors:v21:12e5d5782adb405739b8ac420f584ed3
-->
class="signup-prompt-bg
rounded-1">
class="signup-prompt
p-4
mb-4
action="/prompt_dismissals/signup"
method="post"><input
/><input
name="_method"
value="put"
name="authenticity_token"
value="QfXHbpLuc4wtvLBhl2SRO42pBVDgUGniGrf1p+DQ1sAlrP3no0cEjEnTtZuGMt5HKaA6SIZul20TmrNbMJStew=="
type="submit"
class="position-absolute
btn-link
link-gray"
up
prompt,
Dismiss,
text:dismiss">
Dismiss
<h3
class="pt-2">Join
today</h3>
<p
class="col-6
mx-auto">GitHub
home
over
40
million
developers
working
together
host
and
review
code,
manage
projects,
build
software
together.</p>
btn-primary"
data-hydro-click="{&quot;event_type&quot;:&quot;authentication.click&quot;,&quot;payload&quot;:{&quot;location_in_page&quot;:&quot;files
signup
prompt&quot;,&quot;repository_id&quot;:null,&quot;auth_type&quot;:&quot;SIGN_UP&quot;,&quot;client_id&quot;:null,&quot;originating_request_id&quot;:&quot;BC10:591F:3910329:5FC7AAB:5DE93AF5&quot;,&quot;originating_url&quot;:&quot;https://github.com/vansky/neural-complexity/blob/master/data/wikitext-2/train.txt&quot;,&quot;referrer&quot;:null,&quot;user_id&quot;:null}}"
data-hydro-click-hmac="54f372a190812ebc6ac8e9d245d1e5f072614e5d9820ef59b1ba535a836b535e"
text:sign-up"
href="/join?source=prompt-blob-show&amp;source_repo=vansky%2Fneural-complexity">Sign
up</a>
flex-items-start
pb-3
flex-column
flex-md-row">
width-md-auto">
class="details-reset
select-menu
branch-select-menu
hx_rsm"
id="branch-select-menu">
select-menu-button
css-truncate"
data-hotkey="w"
title="Switch
branches
tags">
<i>Branch:</i>
class="css-truncate-target"
data-menu-button>master</span>
<details-menu
class="select-menu-modal
hx_rsm-modal
position-absolute"
style="z-index:
99;"
src="/vansky/neural-complexity/ref-list/master/data/wikitext-2/train.txt?source_action=show&amp;source_controller=blob"
preload>
<include-fragment
class="select-menu-loading-overlay
anim-pulse">
octicon-octoface"
d="M14.7
5.34c.13-.32.55-1.59-.13-3.31
0-1.05-.33-3.44
1.3-1-.28-2.07-.32-3.13-.32s-2.13.04-3.13.32c-2.39-1.64-3.44-1.3-3.44-1.3-.68
1.72-.26
2.99-.13
3.31C.49
6.21
7.33
13.84
3.33
7.98
15S16
8.69c0-1.36-.49-2.48-1.3-3.35zM8
14.02c-3.3
0-5.98-.15-5.98-3.35
0-.76.38-1.48
1.02-2.07
1.07-.98
2.9-.46
4.96-.46
2.07
3.88-.52
4.96.46.65.59
1.02
1.3
3.19-2.68
3.35-5.98
3.35zM5.49
9.01c-.66
0-1.2.8-1.2
1.78s.54
1.79
1.79c.66
1.2-.8
1.2-1.79s-.54-1.78-1.2-1.78zm5.02
0c-.66
0-1.2.79-1.2
1.2-1.79s-.53-1.78-1.2-1.78z"/></svg>
</include-fragment>
</details-menu>
class="BtnGroup
d-md-none">
href="/vansky/neural-complexity/find/master"
class="js-pjax-capture-input
BtnGroup-item"
data-pjax
data-hotkey="t">
Find
file
<clipboard-copy
value="data/wikitext-2/train.txt"
BtnGroup-item">
Copy
path
</clipboard-copy>
<h2
id="blob-path"
class="breadcrumb
min-width-0
flex-md-self-center
ml-md-2
mr-md-3
my-2
my-md-0">
class="js-repo-root
text-bold"><span
class="js-path-segment"><a
data-pjax="true"
href="/vansky/neural-complexity"><span>neural-complexity</span></a></span></span><span
class="separator">/</span><span
href="/vansky/neural-complexity/tree/master/data"><span>data</span></a></span><span
href="/vansky/neural-complexity/tree/master/data/wikitext-2"><span>wikitext-2</span></a></span><span
class="separator">/</span><strong
class="final-path">train.txt</strong>
</h2>
d-md-inline-block">
src="/vansky/neural-complexity/contributors/master/data/wikitext-2/train.txt"
Box--condensed
commit-loader">
class="Box-body
bg-blue-light
f6">
Fetching
contributors&hellip;
flex-items-center"
class="loader-loading
mr-2"
src="https://github.githubassets.com/images/spinners/octocat-spinner-32-EAF2F5.gif"
class="text-red
h6
loader-error">Cannot
retrieve
contributors
time</span>
mt-3
position-relative">
class="Box-header
py-2
flex-md-row
flex-md-items-center">
class="text-mono
pr-3
flex-order-2
flex-md-order-1
mt-2
mt-md-0">
10.3
MB
py-md-0
flex-order-1
flex-md-order-2
flex-sm-grow-0
flex-justify-between">
class="BtnGroup">
id="raw-url"
href="/vansky/neural-complexity/raw/master/data/wikitext-2/train.txt">Download</a>
href="/vansky/neural-complexity/commits/master/data/wikitext-2/train.txt">History</a>
<div>
class="inline-form"
action="/vansky/neural-complexity/delete/master/data/wikitext-2/train.txt"
value="dBoyBdzqCIzPq0D1CqQIw4hVIQESbEtbyNdztyHhrZx9vio5Ov2BGLyGD2k65uvd/NBRyMVmWr0Eb3RGe2Lnmg=="
class="btn-octicon
btn-octicon-danger
tooltipped-nw"
make
propose
changes"
data-disable-with>
octicon-trashcan"
2H9c0-.55-.45-1-1-1H5c-.55
.45-1
1H2c-.55
1v1c0
.55.45
1v9c0
1h7c.55
1-.45
1-1V5c.55
1-1V3c0-.55-.45-1-1-1zm-1
12H3V5h1v8h1V5h1v8h1V5h1v8h1V5h1v9zm1-10H2V3h9v1z"/></svg>
itemprop="text"
blob-wrapper
data
type-text
class="text-center
href="/vansky/neural-complexity/blob/master/data/wikitext-2/train.txt?raw=true">View
raw</a>
<p>(Sorry
about
that,
but
we
can’t
show
files
are
big
right
now.
)</p>
details-overlay-dark">
data-hotkey="l"
aria-label="Jump
line"></summary>
<details-dialog
Box--overlay
anim-fade-in
fast
linejump"
line">
class="js-jump-to-line-form
Box-body
d-flex"
action=""
linejump-input
js-jump-to-line-field"
placeholder="Jump
line&hellip;"
line"
autofocus>
class="btn"
data-close-dialog>Go</button>
</details-dialog>
</main>
class="footer
p-responsive"
role="contentinfo">
flex-row-reverse
flex-lg-row
flex-lg-justify-between
pt-6
pb-2
mt-6
text-gray
border-top
border-gray-light
col-12
col-lg-5
class="mr-3
mr-lg-0">&copy;
2019
GitHub,
Inc.</li>
mr-lg-0"><a
data-ga-click="Footer,
terms,
text:terms"
href="https://github.com/site/terms">Terms</a></li>
privacy,
text:privacy"
href="https://github.com/site/privacy">Privacy</a></li>
security,
text:security"
href="https://github.com/security">Security</a></li>
href="https://githubstatus.com/"
status,
text:status">Status</a></li>
<li><a
help,
text:help"
href="https://help.github.com">Help</a></li>
title="GitHub"
class="footer-octicon
d-lg-block
mx-lg-4"
href="https://github.com">
octicon-mark-github"
width="24"
contact,
text:contact"
href="https://github.com/contact">Contact
GitHub</a></li>
href="https://github.com/pricing"
Pricing,
text:Pricing">Pricing</a></li>
href="https://developer.github.com"
api,
text:api">API</a></li>
href="https://training.github.com"
training,
text:training">Training</a></li>
href="https://github.blog"
blog,
text:blog">Blog</a></li>
about,
text:about"
href="https://github.com/about">About</a></li>
pb-6">
class="f6
text-gray-light"></span>
id="ajax-error-message"
class="ajax-error-message
flash
flash-error">
octicon-alert"
d="M8.893
1.5c-.183-.31-.52-.5-.887-.5s-.703.19-.886.5L.138
13.499a.98.98
000
1.001c.193.31.53.501.886.501h13.964c.367
.704-.19.877-.5a1.03
1.03
00.01-1.002L8.893
1.5zm.133
11.497H6.987v-2.003h2.039v2.003zm0-3.004H6.987V5.987h2.039v4.006z"/></svg>
class="flash-close
js-ajax-error-dismiss"
aria-label="Dismiss
error">
octicon-x"
You
perform
action
time.
<script
integrity="sha512-mdrBasYG+QjgS391PSyVkPr06io3gWplCVbPscguetNEHxIEt+mZwCeCxPR9eMNfda6qNuibNFqBo5ak2+O/hg=="
type="application/javascript"
src="https://github.githubassets.com/assets/compat-bootstrap-99dac16a.js"></script>
integrity="sha512-70iNd/Gg+yLXPhfcelP5Zr8W3AA2fp2GsH2O/ZLbKoNOS51UGEKF/twbq+aS7x15R9F80cENGrgErdVG5frxqQ=="
src="https://github.githubassets.com/assets/frameworks-ef488d77.js"></script>
async="async"
integrity="sha512-TaQa4aAzMoNdKy9m5YYU7UICMKMOD3xycYuovjVypz3p/7556g3yNbQH4v07yUtDRgmNYeLcfBMomUoJF9RRUw=="
src="https://github.githubassets.com/assets/github-bootstrap-4da41ae1.js"></script>
class="js-stale-session-flash
flash-warn
flash-banner"
hidden
class="js-stale-session-flash-signed-in"
hidden>You
another
tab
window.
href="">Reload</a>
refresh
your
session.</span>
class="js-stale-session-flash-signed-out"
out
<template
id="site-details-dialog">
details-overlay-dark
lh-default
text-gray-dark
open>
role="button"
aria-label="Close
dialog"></summary>
hx_rsm-dialog
hx_rsm-modal">
class="Box-btn-octicon
btn-octicon
top-0"
dialog"
data-close-dialog>
class="octocat-spinner
my-6
js-details-dialog-spinner"></div>
</template>
class="Popover
js-hovercard-content
style="display:
none;
outline:
none;"
tabindex="0">
class="Popover-message
Popover-message--bottom-left
Popover-message--large
Box
box-shadow-large"
style="width:360px;">
aria-live="polite"
class="js-global-screen-reader-notice
sr-only"></div>
</body>
</html>
<unk>
